Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/adchs.h
#define ADCHS_ADCGIRQEN1SET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCGIRQEN1SET) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1INV : (ADCHS Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCGIRQEN1INV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1INV) Bit invert register  Reset Value */

#define ADCHS_ADCGIRQEN1INV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCGIRQEN1INV) Register Mask  */


/* -------- ADCHS_ADCCSS1 : (ADCHS Offset: 0xA0) (R/W 32)  -------- */
#define ADCHS_ADCCSS1_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1)   Reset Value */

#define ADCHS_ADCCSS1_CSS0_Pos                _UINT32_(0)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS0_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS0_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS0(value)             (ADCHS_ADCCSS1_CSS0_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS0_Pos)) /* Assigment of value for CSS0 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS0_SEL_AN0_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS0_SKIP_AN0_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS0_SEL_AN0            (ADCHS_ADCCSS1_CSS0_SEL_AN0_Val << ADCHS_ADCCSS1_CSS0_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS0_SKIP_AN0           (ADCHS_ADCCSS1_CSS0_SKIP_AN0_Val << ADCHS_ADCCSS1_CSS0_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS1_Pos                _UINT32_(1)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS1_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS1_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS1(value)             (ADCHS_ADCCSS1_CSS1_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS1_Pos)) /* Assigment of value for CSS1 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS1_SEL_AN1_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS1_SKIP_AN1_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS1_SEL_AN1            (ADCHS_ADCCSS1_CSS1_SEL_AN1_Val << ADCHS_ADCCSS1_CSS1_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS1_SKIP_AN1           (ADCHS_ADCCSS1_CSS1_SKIP_AN1_Val << ADCHS_ADCCSS1_CSS1_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS2_Pos                _UINT32_(2)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS2_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS2_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS2(value)             (ADCHS_ADCCSS1_CSS2_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS2_Pos)) /* Assigment of value for CSS2 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS2_SEL_AN2_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS2_SKIP_AN2_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS2_SEL_AN2            (ADCHS_ADCCSS1_CSS2_SEL_AN2_Val << ADCHS_ADCCSS1_CSS2_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS2_SKIP_AN2           (ADCHS_ADCCSS1_CSS2_SKIP_AN2_Val << ADCHS_ADCCSS1_CSS2_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS3_Pos                _UINT32_(3)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS3_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS3_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS3(value)             (ADCHS_ADCCSS1_CSS3_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS3_Pos)) /* Assigment of value for CSS3 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS3_SEL_AN3_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS3_SKIP_AN3_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS3_SEL_AN3            (ADCHS_ADCCSS1_CSS3_SEL_AN3_Val << ADCHS_ADCCSS1_CSS3_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS3_SKIP_AN3           (ADCHS_ADCCSS1_CSS3_SKIP_AN3_Val << ADCHS_ADCCSS1_CSS3_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS4_Pos                _UINT32_(4)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS4_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS4_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS4(value)             (ADCHS_ADCCSS1_CSS4_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS4_Pos)) /* Assigment of value for CSS4 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS4_SEL_AN4_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS4_SKIP_AN4_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS4_SEL_AN4            (ADCHS_ADCCSS1_CSS4_SEL_AN4_Val << ADCHS_ADCCSS1_CSS4_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS4_SKIP_AN4           (ADCHS_ADCCSS1_CSS4_SKIP_AN4_Val << ADCHS_ADCCSS1_CSS4_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS5_Pos                _UINT32_(5)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS5_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS5_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS5(value)             (ADCHS_ADCCSS1_CSS5_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS5_Pos)) /* Assigment of value for CSS5 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS5_SEL_AN5_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS5_SKIP_AN5_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS5_SEL_AN5            (ADCHS_ADCCSS1_CSS5_SEL_AN5_Val << ADCHS_ADCCSS1_CSS5_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS5_SKIP_AN5           (ADCHS_ADCCSS1_CSS5_SKIP_AN5_Val << ADCHS_ADCCSS1_CSS5_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS6_Pos                _UINT32_(6)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS6_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS6_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS6(value)             (ADCHS_ADCCSS1_CSS6_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS6_Pos)) /* Assigment of value for CSS6 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS6_SEL_AN6_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS6_SKIP_AN6_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS6_SEL_AN6            (ADCHS_ADCCSS1_CSS6_SEL_AN6_Val << ADCHS_ADCCSS1_CSS6_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS6_SKIP_AN6           (ADCHS_ADCCSS1_CSS6_SKIP_AN6_Val << ADCHS_ADCCSS1_CSS6_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS7_Pos                _UINT32_(7)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS7_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS7_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS7(value)             (ADCHS_ADCCSS1_CSS7_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS7_Pos)) /* Assigment of value for CSS7 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS7_SEL_AN7_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS7_SKIP_AN7_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS7_SEL_AN7            (ADCHS_ADCCSS1_CSS7_SEL_AN7_Val << ADCHS_ADCCSS1_CSS7_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS7_SKIP_AN7           (ADCHS_ADCCSS1_CSS7_SKIP_AN7_Val << ADCHS_ADCCSS1_CSS7_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS8_Pos                _UINT32_(8)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS8_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS8_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS8(value)             (ADCHS_ADCCSS1_CSS8_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS8_Pos)) /* Assigment of value for CSS8 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS8_SEL_AN8_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS8_SKIP_AN8_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS8_SEL_AN8            (ADCHS_ADCCSS1_CSS8_SEL_AN8_Val << ADCHS_ADCCSS1_CSS8_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS8_SKIP_AN8           (ADCHS_ADCCSS1_CSS8_SKIP_AN8_Val << ADCHS_ADCCSS1_CSS8_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS9_Pos                _UINT32_(9)                                          /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS9_Msk                (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS9_Pos)            /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS9(value)             (ADCHS_ADCCSS1_CSS9_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS9_Pos)) /* Assigment of value for CSS9 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS9_SEL_AN9_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS9_SKIP_AN9_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS9_SEL_AN9            (ADCHS_ADCCSS1_CSS9_SEL_AN9_Val << ADCHS_ADCCSS1_CSS9_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS9_SKIP_AN9           (ADCHS_ADCCSS1_CSS9_SKIP_AN9_Val << ADCHS_ADCCSS1_CSS9_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS10_Pos               _UINT32_(10)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS10_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS10_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS10(value)            (ADCHS_ADCCSS1_CSS10_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS10_Pos)) /* Assigment of value for CSS10 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS10_SEL_AN10_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS10_SKIP_AN10_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS10_SEL_AN10          (ADCHS_ADCCSS1_CSS10_SEL_AN10_Val << ADCHS_ADCCSS1_CSS10_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS10_SKIP_AN10         (ADCHS_ADCCSS1_CSS10_SKIP_AN10_Val << ADCHS_ADCCSS1_CSS10_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_CSS11_Pos               _UINT32_(11)                                         /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Position */
#define ADCHS_ADCCSS1_CSS11_Msk               (_UINT32_(0x1) << ADCHS_ADCCSS1_CSS11_Pos)           /* (ADCHS_ADCCSS1) Analog Common Scan Select bits Mask */
#define ADCHS_ADCCSS1_CSS11(value)            (ADCHS_ADCCSS1_CSS11_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS11_Pos)) /* Assigment of value for CSS11 in the ADCHS_ADCCSS1 register */
#define   ADCHS_ADCCSS1_CSS11_SEL_AN11_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin)  */
#define   ADCHS_ADCCSS1_CSS11_SKIP_AN11_Val   _UINT32_(0x0)                                        /* (ADCHS_ADCCSS1) Skip ANx for input scan  */
#define ADCHS_ADCCSS1_CSS11_SEL_AN11          (ADCHS_ADCCSS1_CSS11_SEL_AN11_Val << ADCHS_ADCCSS1_CSS11_Pos) /* (ADCHS_ADCCSS1) Select ANx for input scan (i.e.ANx = CSSx and scan is sequential starting with the lowest to highest enabled CSSx analog input pin) Position  */
#define ADCHS_ADCCSS1_CSS11_SKIP_AN11         (ADCHS_ADCCSS1_CSS11_SKIP_AN11_Val << ADCHS_ADCCSS1_CSS11_Pos) /* (ADCHS_ADCCSS1) Skip ANx for input scan Position  */
#define ADCHS_ADCCSS1_Msk                     _UINT32_(0x00000FFF)                                 /* (ADCHS_ADCCSS1) Register Mask  */

#define ADCHS_ADCCSS1_CSS_Pos                 _UINT32_(0)                                          /* (ADCHS_ADCCSS1 Position) Analog Common Scan Select bits */
#define ADCHS_ADCCSS1_CSS_Msk                 (_UINT32_(0xFFF) << ADCHS_ADCCSS1_CSS_Pos)           /* (ADCHS_ADCCSS1 Mask) CSS */
#define ADCHS_ADCCSS1_CSS(value)              (ADCHS_ADCCSS1_CSS_Msk & (_UINT32_(value) << ADCHS_ADCCSS1_CSS_Pos)) 

/* -------- ADCHS_ADCCSS1CLR : (ADCHS Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCSS1CLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCSS1CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCSS1CLR) Register Mask  */


/* -------- ADCHS_ADCCSS1SET : (ADCHS Offset: 0xA8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCSS1SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1SET) Bit set register  Reset Value */

#define ADCHS_ADCCSS1SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCSS1SET) Register Mask  */


/* -------- ADCHS_ADCCSS1INV : (ADCHS Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCSS1INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCSS1INV) Bit invert register  Reset Value */

