Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/adchs.h
#define ADCHS_ADCDSTAT1INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCDSTAT1INV) Register Mask  */


/* -------- ADCHS_ADCCMPEN1 : (ADCHS Offset: 0xE0) (R/W 32)  -------- */
#define ADCHS_ADCCMPEN1_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN1)   Reset Value */

#define ADCHS_ADCCMPEN1_CMPE0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE0_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE0_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE0(value)          (ADCHS_ADCCMPEN1_CMPE0_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE0_Pos)) /* Assigment of value for CMPE0 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE1_Pos             _UINT32_(1)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE1_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE1_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE1(value)          (ADCHS_ADCCMPEN1_CMPE1_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE1_Pos)) /* Assigment of value for CMPE1 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE2_Pos             _UINT32_(2)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE2_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE2_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE2(value)          (ADCHS_ADCCMPEN1_CMPE2_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE2_Pos)) /* Assigment of value for CMPE2 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE3_Pos             _UINT32_(3)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE3_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE3_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE3(value)          (ADCHS_ADCCMPEN1_CMPE3_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE3_Pos)) /* Assigment of value for CMPE3 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE4_Pos             _UINT32_(4)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE4_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE4_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE4(value)          (ADCHS_ADCCMPEN1_CMPE4_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE4_Pos)) /* Assigment of value for CMPE4 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE5_Pos             _UINT32_(5)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE5_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE5_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE5(value)          (ADCHS_ADCCMPEN1_CMPE5_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE5_Pos)) /* Assigment of value for CMPE5 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE6_Pos             _UINT32_(6)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE6_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE6_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE6(value)          (ADCHS_ADCCMPEN1_CMPE6_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE6_Pos)) /* Assigment of value for CMPE6 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_CMPE7_Pos             _UINT32_(7)                                          /* (ADCHS_ADCCMPEN1)  Position */
#define ADCHS_ADCCMPEN1_CMPE7_Msk             (_UINT32_(0x1) << ADCHS_ADCCMPEN1_CMPE7_Pos)         /* (ADCHS_ADCCMPEN1)  Mask */
#define ADCHS_ADCCMPEN1_CMPE7(value)          (ADCHS_ADCCMPEN1_CMPE7_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE7_Pos)) /* Assigment of value for CMPE7 in the ADCHS_ADCCMPEN1 register */
#define ADCHS_ADCCMPEN1_Msk                   _UINT32_(0x000000FF)                                 /* (ADCHS_ADCCMPEN1) Register Mask  */

#define ADCHS_ADCCMPEN1_CMPE_Pos              _UINT32_(0)                                          /* (ADCHS_ADCCMPEN1 Position)  */
#define ADCHS_ADCCMPEN1_CMPE_Msk              (_UINT32_(0xFF) << ADCHS_ADCCMPEN1_CMPE_Pos)         /* (ADCHS_ADCCMPEN1 Mask) CMPE */
#define ADCHS_ADCCMPEN1_CMPE(value)           (ADCHS_ADCCMPEN1_CMPE_Msk & (_UINT32_(value) << ADCHS_ADCCMPEN1_CMPE_Pos)) 

/* -------- ADCHS_ADCCMPEN0CLR : (ADCHS Offset: 0xE4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCMPEN0CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN0CLR) Bit clear register  Reset Value */

#define ADCHS_ADCCMPEN0CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN0CLR) Register Mask  */


/* -------- ADCHS_ADCCMPEN0SET : (ADCHS Offset: 0xE8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPEN0SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN0SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPEN0SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN0SET) Register Mask  */


/* -------- ADCHS_ADCCMPEN0INV : (ADCHS Offset: 0xEC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPEN0INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPEN0INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPEN0INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPEN0INV) Register Mask  */


/* -------- ADCHS_ADCCMP1 : (ADCHS Offset: 0xF0) (R/W 32)  -------- */
#define ADCHS_ADCCMP1_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCMP1)   Reset Value */

#define ADCHS_ADCCMP1_ADCMPLO_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCMP1)  Position */
#define ADCHS_ADCCMP1_ADCMPLO_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP1_ADCMPLO_Pos)      /* (ADCHS_ADCCMP1)  Mask */
#define ADCHS_ADCCMP1_ADCMPLO(value)          (ADCHS_ADCCMP1_ADCMPLO_Msk & (_UINT32_(value) << ADCHS_ADCCMP1_ADCMPLO_Pos)) /* Assigment of value for ADCMPLO in the ADCHS_ADCCMP1 register */
#define ADCHS_ADCCMP1_ADCMPHI_Pos             _UINT32_(16)                                         /* (ADCHS_ADCCMP1)  Position */
#define ADCHS_ADCCMP1_ADCMPHI_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCCMP1_ADCMPHI_Pos)      /* (ADCHS_ADCCMP1)  Mask */
#define ADCHS_ADCCMP1_ADCMPHI(value)          (ADCHS_ADCCMP1_ADCMPHI_Msk & (_UINT32_(value) << ADCHS_ADCCMP1_ADCMPHI_Pos)) /* Assigment of value for ADCMPHI in the ADCHS_ADCCMP1 register */
#define ADCHS_ADCCMP1_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCCMP1) Register Mask  */


