Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/ieee_802_15_4/MAC/push_pull_mac_app/demoapp_ffd/firmware/src/packs/PIC32CX1012BZ25048_DFP/component/adchs.h
#define ADCHS_ADCTRGSNS_LVL0_Pos              _UINT32_(0)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL0_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL0_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL0(value)           (ADCHS_ADCTRGSNS_LVL0_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL0_Pos)) /* Assigment of value for LVL0 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL1_Pos              _UINT32_(1)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL1_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL1_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL1(value)           (ADCHS_ADCTRGSNS_LVL1_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL1_Pos)) /* Assigment of value for LVL1 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL2_Pos              _UINT32_(2)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL2_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL2_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL2(value)           (ADCHS_ADCTRGSNS_LVL2_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL2_Pos)) /* Assigment of value for LVL2 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL3_Pos              _UINT32_(3)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL3_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL3_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL3(value)           (ADCHS_ADCTRGSNS_LVL3_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL3_Pos)) /* Assigment of value for LVL3 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL4_Pos              _UINT32_(4)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL4_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL4_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL4(value)           (ADCHS_ADCTRGSNS_LVL4_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL4_Pos)) /* Assigment of value for LVL4 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL5_Pos              _UINT32_(5)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL5_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL5_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL5(value)           (ADCHS_ADCTRGSNS_LVL5_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL5_Pos)) /* Assigment of value for LVL5 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL6_Pos              _UINT32_(6)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL6_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL6_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL6(value)           (ADCHS_ADCTRGSNS_LVL6_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL6_Pos)) /* Assigment of value for LVL6 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL7_Pos              _UINT32_(7)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL7_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL7_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL7(value)           (ADCHS_ADCTRGSNS_LVL7_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL7_Pos)) /* Assigment of value for LVL7 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_Msk                   _UINT32_(0x000000FF)                                 /* (ADCHS_ADCTRGSNS) Register Mask  */

#define ADCHS_ADCTRGSNS_LVL_Pos               _UINT32_(0)                                          /* (ADCHS_ADCTRGSNS Position)  */
#define ADCHS_ADCTRGSNS_LVL_Msk               (_UINT32_(0xFF) << ADCHS_ADCTRGSNS_LVL_Pos)          /* (ADCHS_ADCTRGSNS Mask) LVL */
#define ADCHS_ADCTRGSNS_LVL(value)            (ADCHS_ADCTRGSNS_LVL_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL_Pos)) 

/* -------- ADCHS_ADCTRGSNSCLR : (ADCHS Offset: 0x344) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCTRGSNSCLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNSCLR) Bit clear register  Reset Value */

#define ADCHS_ADCTRGSNSCLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRGSNSCLR) Register Mask  */


/* -------- ADCHS_ADCTRGSNSSET : (ADCHS Offset: 0x348) (R/W 32) Bit set register -------- */
#define ADCHS_ADCTRGSNSSET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNSSET) Bit set register  Reset Value */

#define ADCHS_ADCTRGSNSSET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRGSNSSET) Register Mask  */


/* -------- ADCHS_ADCTRGSNSINV : (ADCHS Offset: 0x34C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCTRGSNSINV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNSINV) Bit invert register  Reset Value */

#define ADCHS_ADCTRGSNSINV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCTRGSNSINV) Register Mask  */


/* -------- ADCHS_ADC0TIMECLR : (ADCHS Offset: 0x354) (R/W 32) Bit clear register -------- */
#define ADCHS_ADC0TIMECLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADC0TIMECLR) Bit clear register  Reset Value */

#define ADCHS_ADC0TIMECLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADC0TIMECLR) Register Mask  */


/* -------- ADCHS_ADC0TIMESET : (ADCHS Offset: 0x358) (R/W 32) Bit set register -------- */
#define ADCHS_ADC0TIMESET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADC0TIMESET) Bit set register  Reset Value */

#define ADCHS_ADC0TIMESET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADC0TIMESET) Register Mask  */


